---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetalPerforationsType
source: html/258542d2-d39e-91ce-1925-d83ce53dc25d.htm
---
# Autodesk.Revit.DB.Visual.MetalPerforationsType

The enumerated type representing the permitted values for the asset property "MetalPerforations" from the "Metal" schema.

## Syntax (C#)
```csharp
public enum MetalPerforationsType
```